Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection.AnalysisSubSectionTypeEnum Enumeration
 Defines the subsection types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisSubSectionTypeEnum
Public Enumeration AnalysisSubSectionTypeEnum
Members
Member name | Value | Description
UNKNOWN_TYPE | 0 |  The subsection subtype is unknown.
I | 4 |  The profile type I.
UNSYMMETRICAL_I | 5 |  The profile type unsymmetrical I.
L | 6 |  The profile type L.
Z | 7 |  The profile type Z.
U | 8 |  The profile type U.
PL | 1 |  The profile type PL.
D | 10 |  The profile type D.
PD | 11 |  The profile type PD.
P | 9 |  The profile type P.
C | 8 |  The profile type C.
T | 2 |  The profile type T.
T_MIRRORED | 3 |  The profile type T mirrored.
USER_DEFINED | 12 |  The profile type user defined.
TWIN_L_1 | 13 |  The profile type twin L 1.
TWIN_L_2 | 14 |  The profile type twin L 2.
TWIN_U_1 | 15 |  The profile type twin U 1.
TWIN_U_2 | 16 |  The profile type twin U 2.
See Also
Reference
Tekla.Structures.Analysis Namespace